тут поставь эмодзи в кнопки щас скажу какие вот из 2 файла вставь все преммиум эмодзи, только чтоб они нормально писались а не tg emodji в кнопках версия у  еня если че  python-telegram-bot==22.7, и 


убери кнопку пропустить в реквизитах там обязательно нужно чтоб добавили для прлучение оплаты или отправки, и в крипте там вче верно но валюты для оплаты/получение нет после выбора крипты , и при выборе преммиум сделки там эмодзи смени на другое вот 5370784581341422520, и там не так пишется там пишет ваедите стоимость преммиум а надо " Выберите на сколько мес премм ну как то тск исправишь ок"
и пишет в какой аалюте оплата а надо выберите валюту для оплаты если создает покупатель а если создает продавец выберите валюту для получение оплаты, и когда выбираю валюту он сразу кидает ссылку на сделку, и опять когда тот кто создал сделку создает сделку второй присоединяется у него не открывается карточка сделки чтоб ему писало то же что пишет тому кто присоединился типо сделку саму, в логах тоже я сказал же эмодзи везде сделай
`5258262708838472996`, подарок `5258362837411045098`, деньги `5807499888245612254`
`даже если логи я сам ставлю то слелай так чтоб эти эмодзи писались в любом случае типо если я даже свой текст добавлю вместо твоего короче они везде должны быть кроме доп группы,`
и там должно быть в логах типо
`5258262708838472996`, время захода `5258362837411045098`, суть сделки `5807499888245612254, айди того кто создал сделку`
`и юз, и там еще инлайн кнопка в логах пишется тг эмодзи ее тоже кастомноц преммиум сделай как и все остальные унопки, обязательно`
`и в /neptunteam должно быть чтоб человек мог удалять все типо и отзывы и оборот и тд, и на английском когда пишешь в реквизитах номер там обязательно на +1 должно начинаться или на 2 типо номер карты или телефог и название банков на англ тоже обязательно , и в карточке сделки должно быть написано если создает покупатель "Продавец передайте товар менеджеру @GiftDealsManager затем покупатель передаст вам товар." а` `если наоборот создает продавец то все так же но передать должен покупатель, и там тех поддержку убери в карточке сделки`




`сделай тут что то если не сделал главное кнопки почини и остальное плз и дай в одном тексте все`
